blog/2010/11/06/after-a-lapse-of-march-released-solar-system-win-1_1_1-0_4-version-and-update-the-solar-offline-documentation/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>时隔三月，发布solar-system-win-1.1.1-0.4版并更新solar离线文档！ - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="as_sitesearch" value="guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>时隔三月，发布solar-system-win-1.1.1-0.4版并更新solar离线文档！</h1>
  <p>
时隔三月，终发布solar-win-1.1.1的第四个版本，这段时间非常忙碌，和林军、熊正理、刘修宏一起创办公司（长沙市尤盛网络科技有限公司），和李铁一起共事。期间领导团队帮助名师网开发暑期选课系统、开发免单社区站(<a href="http://miandan.net">http://miandan.net</a>)。
</p>

<p>
紧接着就是毕业生找工作，一直就没有停止过，也一直沉不下心来做事情。所幸我已基本脱离这种状态，又回来了！
</p>

<p>
闲话不多说了，新版本主要解决上一个版本中的Bug:
</p>
<ol class="org-ol">
<li>在link-vendor时，无论是否存在vendor，都会在script目录下建立vendor.bat和vendor的链接
</li>
<li>在windows xp, 2000, 2003下，sync-vendor命令仍然存在很多问题，经常出现代码丢失等现象。
</li>
</ol>
<p>
另外，新的离线文档更新了Package部分的格式，更清晰明了。
</p>

<p>
*Solar下载地址：*下载地址：<a href="http://solarphp.cn/download/solar-system-1.1.1-win-0.4.rar"><a href="http://solarphp.cn/download/solar-system-1.1.1-win-0.4.rar">http://solarphp.cn/download/solar-system-1.1.1-win-0.4.rar</a></a>
当然，你也可以到这里下载，<a href="http://solarphp.cn/download/solar-system-win-latest.rar"><a href="http://solarphp.cn/download/solar-system-win-latest.rar">http://solarphp.cn/download/solar-system-win-latest.rar</a></a>
这是目前的最新版，可能是当前发布版，也可能有下一个版本的某些新功能。
*文档下载地址：*<a href="http://solarphp.cn/download/solar_manual_offline_v1.3.chm"><a href="http://solarphp.cn/download/solar\_manual\_offline\_v1.3.chm">http://solarphp.cn/download/solar\_manual\_offline\_v1.3.chm</a></a>
不过过去的三个月并非无进展：
一、 我们建立了<a href="http://demo.solarphp.cn">solar功能演示站</a>
</p>
<ol class="org-ol">
<li>Ajax演示 - Roy
</li>
</ol>
<p>
(1)<a href="http://demo.solarphp.cn/ajax/">http://demo.solarphp.cn/ajax/</a>
(2)<a href="http://demo.solarphp.cn/ajax/form">http://demo.solarphp.cn/ajax/form</a>
</p>
<ol class="org-ol">
<li>图片处理演示 - Roy
</li>
</ol>
<p>
(1) <a href="http://demo.solarphp.cn/image/magick">http://demo.solarphp.cn/image/magick</a>
(2) <a href="http://demo.solarphp.cn/image/gd">http://demo.solarphp.cn/image/gd</a>
</p>
<ol class="org-ol">
<li>支付演示 - Roy
</li>
</ol>
<p>
(1) <a href="http://demo.solarphp.cn/pay/alipay">http://demo.solarphp.cn/pay/alipay</a>
</p>
<ol class="org-ol">
<li>上传演示 - Roy
</li>
</ol>
<p>
(1) 附件上传：<a href="http://demo.solarphp.cn/upload/attachment">http://demo.solarphp.cn/upload/attachment</a>
(2) 图片上传：<a href="http://demo.solarphp.cn/upload/image">http://demo.solarphp.cn/upload/image</a>
</p>
<ol class="org-ol">
<li>验证码演示 - Life
</li>
</ol>
<p>
(1) <a href="http://demo.solarphp.cn/captcha/index">http://demo.solarphp.cn/captcha/index</a>
</p>
<ol class="org-ol">
<li>购物车演示 - Roy
</li>
</ol>
<p>
(1) <a href="http://demo.solarphp.cn/cart/index">http://demo.solarphp.cn/cart/index</a>
</p>
<ol class="org-ol">
<li>代码高亮演示 - Roy
</li>
</ol>
<p>
(1) 在每个演示中都有代码显示，不过这个插件主要是由Libear完成的，Life提出了很好的建议，由Roy修改，现为版本0.2
二、我们开发了相当多的类库并将继续开发
(1) Web Service: XML-RPC, Json-RPC, Soap
(2) Pay: Alipay(已完成), 财付通, 百付宝, 网银在线
(3) 购物车(已完成)
(4) Ajax(已完成)
(5) 文件上传 - Upload(已完成)
(6) 图片处理 - Image(已完成)
(7) 验证码 - Captcha(已完成)
(8) 代码高亮 - Geshi(已完成)
</p>

<p>
在接下来的日子里，我会继续努力，为开源社区贡献自己的力量。
</p>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
